import streamlit as st

st.title("美食指南手冊")

st.markdown(
    """
   待補
    """
)
st.title("🇪🇸西班牙")
st.header("1.炭烤香料馬鈴薯章魚腳 Pulpo a la Gallega(Galician-style octopus)")

markdown = """
源自西班牙西北部的加利西亞（Galicia）地區，加利西亞有著悠久的海鮮捕撈歷史，尤其是章魚，這使得章魚成為當地餐桌上的重要食材之一。而這道菜也是一種文化象徵，代表著加利西亞人對海洋資源和傳統烹飪的敬意。例如，在加利西亞的章魚節（Festa do Pulpo），這道菜會被大規模製作和享用，成為當地居民和遊客共同慶祝的中心。

這道菜的主要特色是將章魚腳和馬鈴薯結合，經過燒烤和香料調味，口感鮮嫩且極具層次感，通常作為前菜或共享菜品來享用，搭配著一杯清爽的白葡萄酒。

"""
st.markdown(markdown)

st.header("2.西班牙海鮮大鍋飯 Paella de Marisco")

markdown = """
Paella（帕埃利亞）這個名字本身，來自於西班牙的瓦倫西亞地區（Valencia）。隨著西班牙飲食文化的傳播，Paella 也逐漸成為全球著名的西班牙美食之一。各地的餐廳和家庭都會根據自己的需求，創造出不同版本的 Paella。

香料中的藏紅花不僅賦予飯菜金黃的顏色，也帶來特有的香氣，使整道菜味道更加豐富。海鮮的口感鮮嫩多汁，並且搭配著香脆的米飯底部（稱為socarrat），深受許多食客所喜愛。
"""
st.markdown(markdown)

st.header("3.秘密西班牙松阪豬 Secreto de Cerdo a la Plancha")

markdown = """
名稱中的“Secreto”意指豬肉的「秘密部位」，這是豬肉上非常嫩且風味極佳的一部分，來自豬肩膀附近的部位，因其形狀不規則且含有豐富的脂肪，通常在傳統的分肉過程中會被忽略不容易在傳統的肉類分切中發現，這也是它被稱為「秘密」的原因。

松阪豬肉中含有較多的脂肪，這使得這道菜既有豐富的肉香，又不會過於油膩。煎烤後的豬肉表面帶有一層脆皮，內部依然保持嫩滑多汁，口感層次分明。橄欖油和鹽調味後，肉的鮮美被充分展現，簡單卻極為美味。

"""
st.markdown(markdown)
